{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# SPARQLクエリ集\n",
    "https://wp.lodosaka.jp/tool/sparqlquery/　\n",
    "より"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper\n",
    "sparql = SPARQLWrapper(endpoint='http://ja.dbpedia.org/sparql', returnFormat='json')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 「東京都を主語（Subject）に含む」トリプルの述語(?p）と目的語(?o)を取得する\n",
    "sparql.setQuery(\"\"\"                                                                                                                                                                      \n",
    "    PREFIX dbpedia-owl:  <http://dbpedia.org/ontology/>                                                                                                                                  \n",
    "    select distinct * where { <http://ja.dbpedia.org/resource/東京都> ?p ?o . } LIMIT 100                                                                                                                \n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['s']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大阪'}}]}}\n"
     ]
    }
   ],
   "source": [
    "#     「ラベルに“大阪”を含む」トリプルの主語(?s)\n",
    "# サンプルにある #label>?  の ? 不要\n",
    "sparql.setQuery(\"\"\"                                                                                                                                                                      \n",
    "select distinct ?s where {\n",
    "  ?s <http://www.w3.org/2000/01/rdf-schema#label> \"大阪\"@ja .\n",
    "}LIMIT 100\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://ja.dbpedia.org/sparql?default-graph-uri=http%3A%2F%2Fja.dbpedia.org&\n",
    "# query=PREFIX+rdfs%3A+%3Chttp%3A%2F%2Fwww.w3.org%2F2000%2F01%2Frdf-schema%23%3E%0D%0A\n",
    "# select+distinct+%3Fp+%3Fo+where+%7B%0D%0A++\n",
    "# %3Fs+rdfs%3Alabel+%22%E5%A4%A7%E9%98%AA%22%40ja+.++%0D%0A++%3Fs+%3Fp+%3Fo.%0D%0A%7DLIMIT+100&format=text%2Fhtml&timeout=0&debug=on\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "select distinct ?p ?o where {\n",
    "  ?s rdfs:label \"大阪府\"@ja . \n",
    "  ?s ?p ?o.\n",
    "}LIMIT 100\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#「ラベルが“大阪”と一致する」トリプルの主語(?s)につながっている述語(?p)と目的語(?o)\n",
    "sparql.setQuery(\"\"\"\n",
    "select distinct ?s where {\n",
    "  ?s <http://www.w3.org/2000/01/rdf-schema#label> ?o \n",
    "  FILTER(regex(str(?o), \"大阪\" )) .\n",
    "}LIMIT 100\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# 大阪府が持つプロパティ一覧\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-ja: <http://ja.dbpedia.org/resource/>\n",
    "select distinct ?p where {\n",
    "  dbpedia-ja:大阪府 ?p ?o.\n",
    "}\n",
    "\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# プリキュアシリーズが持つプロパティ一覧\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-ja: <http://ja.dbpedia.org/resource/>\n",
    "select distinct ?p where {\n",
    "  dbpedia-ja:プリキュアシリーズ ?p ?o.\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['s']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/三重県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/京都府'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/佐賀県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/兵庫県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/北海道'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/千葉県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/和歌山県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/埼玉県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大分県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大阪府'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/奈良県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/宮城県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/宮崎県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/富山県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山口県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山形県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山梨県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/岐阜県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/岡山県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/岩手県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/島根県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/広島県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/徳島県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/愛媛県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/愛知県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/新潟県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京都'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/栃木県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/沖縄県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/滋賀県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/熊本県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/石川県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/神奈川県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/福井県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/福岡県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/福島県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/秋田県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/群馬県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/茨城県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/長崎県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/長野県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/青森県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/静岡県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/香川県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/高知県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/鳥取県'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/鹿児島県'}}]}}\n"
     ]
    }
   ],
   "source": [
    "# 日本の都道府県一覧\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-owl:  <http://dbpedia.org/ontology/>\n",
    "PREFIX category-ja: <http://ja.dbpedia.org/resource/Category:>\n",
    "select distinct ?s where {\n",
    "  ?s rdf:type dbpedia-owl:Place.\n",
    "  ?s dbpedia-owl:wikiPageWikiLink category-ja:日本の都道府県.\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['s']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/CLUB_ココ&ナッツ'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/吉田仁美のプリキュアラジオ_キュアキュア♡プリティ'}}]}}\n"
     ]
    }
   ],
   "source": [
    "# Category:プリキュアシリーズのテレビアニメが持つプロパティ一覧\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-owl:  <http://dbpedia.org/ontology/>\n",
    "PREFIX category-ja: <http://ja.dbpedia.org/resource/Category:>\n",
    "select distinct ?s where {\n",
    "  ?s rdf:type dbpedia-owl:Anime.\n",
    "  ?s dbpedia-owl:wikiPageWikiLink category-ja:プリキュアシリーズ.\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['s']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Go!プリンセスプリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HUGっと!プリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Yes!プリキュア5'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ふたりはプリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ふたりはプリキュア_Splash_Star'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/キラキラ☆プリキュアアラモード'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/スイートプリキュア♪'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/スター☆トゥインクルプリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/スマイルプリキュア!'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/トロピカル〜ジュ!プリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ドキドキ!プリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハピネスチャージプリキュア!'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハートキャッチプリキュア!'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ヒーリングっど♥プリキュア'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/フレッシュプリキュア!'}}, {'s': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/魔法つかいプリキュア!'}}]}}\n"
     ]
    }
   ],
   "source": [
    "# Category:プリキュアシリーズのテレビアニメ\n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-owl:  <http://dbpedia.org/ontology/>\n",
    "PREFIX category-ja: <http://ja.dbpedia.org/resource/Category:>\n",
    "select distinct ?s where {\n",
    "  ?s rdf:type dbpedia-owl:Anime.\n",
    "  ?s dbpedia-owl:wikiPageWikiLink category-ja:プリキュアシリーズのテレビアニメ.\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['p']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'p': {'type': 'uri', 'value': 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'}}, {'p': {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}}, {'p': {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#comment'}}, {'p': {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/_'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/header'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/id'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/name'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/redirect'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/ジャンル'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/メンバー'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/レーベル'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/事務所'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/事業内容'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/代表者'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/公式サイト'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/共同作業者'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/名前'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/従業員数'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/旧メンバー'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/本社所在地'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/本社郵便番号'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/活動期間'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/特記事項'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/画像'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/画像説明'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/社名'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/種類'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/背景色'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/設立'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/資本金'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/関係する人物'}}, {'p': {'type': 'uri', 'value': 'http://purl.org/dc/terms/subject'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageID'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageRevisionID'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageExternalLink'}}, {'p': {'type': 'uri', 'value': 'http://ja.dbpedia.org/property/wikiPageUsesTemplate'}}, {'p': {'type': 'uri', 'value': 'http://xmlns.com/foaf/0.1/homepage'}}, {'p': {'type': 'uri', 'value': 'http://www.w3.org/ns/prov#wasDerivedFrom'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/abstract'}}, {'p': {'type': 'uri', 'value': 'http://xmlns.com/foaf/0.1/isPrimaryTopicOf'}}, {'p': {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageLength'}}]}}\n"
     ]
    }
   ],
   "source": [
    "#　乃木坂46のプロパティ一覧 \n",
    "sparql.setQuery(\"\"\"\n",
    "PREFIX dbpedia-ja: <http://ja.dbpedia.org/resource/>\n",
    "select distinct ?p where {\n",
    "  dbpedia-ja:乃木坂46 ?p ?o.\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'link': [], 'vars': ['wikiLink', 'label']}, 'results': {'distinct': False, 'ordered': True, 'bindings': [{'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/齋藤飛鳥'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '齋藤飛鳥'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/109_(商業施設)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '109 (商業施設)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/16人のプリンシパル'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '16人のプリンシパル'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/2011年'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '2011年'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/2012_FIFA_U-20女子ワールドカップ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '2012 FIFA U-20女子ワールドカップ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/2016年問題'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '2016年問題'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/2018_FNS歌謡祭'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '2018 FNS歌謡祭'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/8月21日'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '8月21日'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/AKB48'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/AKB48_SHOW!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48 SHOW!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/AKB48のオールナイトニッポン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48のオールナイトニッポン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/AKB48グループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48グループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/AKB48選抜総選挙'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48選抜総選挙'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ALL_MV_COLLECTION2〜あの時の彼女たち〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ALL MV COLLECTION2〜あの時の彼女たち〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ALL_MV_COLLECTION〜あの時の彼女たち〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ALL MV COLLECTION〜あの時の彼女たち〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/An・an'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'An・an'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Au_(携帯電話)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Au (携帯電話)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/B.L.T.'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'B.L.T.'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/BADBOYS'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'BADBOYS'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/BOMB'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'BOMB'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/BSスカパー!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'BSスカパー!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Blu-ray_Disc'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Blu-ray Disc'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/CD-DA'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'CD-DA'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/CHIMO'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'CHIMO'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/CM_NOW'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'CM NOW'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/COUNT_DOWN_TV'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'COUNT DOWN TV'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:10人組以上の音楽グループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '10人組以上の音楽グループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:2011年に結成した音楽グループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '2011年に結成した音楽グループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:NHK紅白歌合戦出演者'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'NHK紅白歌合戦出演者'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:ソニー・ミュージックレコーズのアーティスト'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ソニー・ミュージックレコーズのアーティスト'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:乃木坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:坂道シリーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '坂道シリーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:日本のガール・グループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本のガール・グループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:日本の女性アイドルグループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本の女性アイドルグループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:秋元康'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '秋元康'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/DIP'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'DIP'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/DVD-Video'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'DVD-Video'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/EX_THEATER_ROPPONGI'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'EX THEATER ROPPONGI'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/FLASH_(写真週刊誌)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'FLASH (写真週刊誌)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/FRIDAY_(雑誌)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'FRIDAY (雑誌)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Good-bye_days'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Good-bye days'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HBCカップジャンプ競技会'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'HBCカップジャンプ競技会'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HTC_(企業)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'HTC (企業)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HTL21'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'HTL21'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HTL23'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'HTL23'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/HoneyWorks'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'HoneyWorks'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ISW13HT'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ISW13HT'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/IZ*ONE'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'IZ*ONE'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/J-POP'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'J-POP'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/JR東日本ウォータービジネス'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'JR東日本ウォータービジネス'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Japan_Expo'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Japan Expo'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/KADOKAWA'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'KADOKAWA'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/LARME'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'LARME'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/LINE_LIVE'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'LINE LIVE'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/MAZE_(映画)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'MAZE (映画)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/MUSIC_JAPAN'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'MUSIC JAPAN'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Mina_(雑誌)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Mina (雑誌)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/My_first_baito'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'My first baito'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/NARUTO_-ナルト-_疾風伝'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'NARUTO -ナルト- 疾風伝'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/NMB48'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'NMB48'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/NOGIBINGO!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'NOGIBINGO!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Non-no'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Non-no'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Olive'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Olive'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/PARCO劇場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'PARCO劇場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Route_246'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Route 246'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Rの法則'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Rの法則'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/SHOWROOM_(ストリーミングサービス)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'SHOWROOM (ストリーミングサービス)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/SKE48'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'SKE48'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/SPLASH_(モラドカンパニー)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'SPLASH (モラドカンパニー)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/STU48'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'STU48'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Samurai_ELO'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Samurai ELO'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Sing_Out!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Sing Out!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/TBS系列'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'TBS系列'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/TBS赤坂ACTシアター'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'TBS赤坂ACTシアター'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/TXNネットワーク'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'TXNネットワーク'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/UP_to_boy'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'UP to boy'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/With_(雑誌)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'With (雑誌)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/YOUNG_GUITAR'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'YOUNG GUITAR'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/YUI_(歌手)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'YUI (歌手)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/YouTube'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'YouTube'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Z-Girls'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Z-Girls'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Zepp'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Zepp'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Zeppブルーシアター六本木'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Zeppブルーシアター六本木'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Zipper'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'Zipper'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/あさひなぐ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'あさひなぐ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/いつかできるから今日できる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'いつかできるから今日できる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/いつのまにか、ここにいる_Documentary_of_乃木坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'いつのまにか、ここにいる Documentary of 乃木坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/うさぎのモフィ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'うさぎのモフィ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/おいでシャンプー'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'おいでシャンプー'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/お台場みんなの夢大陸'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'お台場みんなの夢大陸'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/かもめ食堂'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'かもめ食堂'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ぐるぐるカーテン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ぐるぐるカーテン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/さいたまスーパーアリーナ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'さいたまスーパーアリーナ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/しあわせの保護色'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'しあわせの保護色'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/じょしらく'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'じょしらく'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/すべての犬は天国へ行く'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'すべての犬は天国へ行く'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/それぞれの椅子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'それぞれの椅子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/はるやま商事'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'はるやま商事'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/めがね_(映画)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'めがね (映画)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/めざましどようび'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'めざましどようび'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/アイアシアタートーキョー'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'アイアシアタートーキョー'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/アイドル'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'アイドル'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/アニメ・フェスティバル・アジア'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'アニメ・フェスティバル・アジア'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/インフルエンサー_(曲)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'インフルエンサー (曲)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/エンターテインメント'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'エンターテインメント'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/オフィスニグンニイバ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'オフィスニグンニイバ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/オリコン年間ランキング'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'オリコン年間ランキング'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/オートバックスセブン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'オートバックスセブン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ガールズルール'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ガールズルール'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/キングレコード'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'キングレコード'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/クォン・ウンビ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'クォン・ウンビ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/コボ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'コボ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/サマンサタバサ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'サマンサタバサ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/サヨナラの意味'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'サヨナラの意味'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ザンビ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ザンビ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/シュートサイン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'シュートサイン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/シンガポール'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'シンガポール'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/シンクロニシティ_(曲)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'シンクロニシティ (曲)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ジコチューで行こう!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ジコチューで行こう!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ジャニーズ事務所'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ジャニーズ事務所'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ジャーバージャ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ジャーバージャ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ジワるDAYS'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ジワるDAYS'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/スカパー!プレミアムサービス'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'スカパー!プレミアムサービス'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/セブン-イレブン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'セブン-イレブン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ソニー・ミュージックエンタテインメント_(日本)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ソニー・ミュージックエンタテインメント (日本)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ソニー・ミュージックレコーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ソニー・ミュージックレコーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/タイヨウのうた_(曲)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'タイヨウのうた (曲)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ダリヤ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ダリヤ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ダ・ヴィンチ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ダ・ヴィンチ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/チェッカーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'チェッカーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/チャン・ウォニョン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'チャン・ウォニョン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/チョ・ユリ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'チョ・ユリ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/テレビ愛知'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'テレビ愛知'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/テレビ朝日'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'テレビ朝日'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/テレビ東京'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'テレビ東京'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/デフスターレコーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'デフスターレコーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/デュッセルドルフ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'デュッセルドルフ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ドイツ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ドイツ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ドラマ24'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ドラマ24'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ナゴヤドーム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ナゴヤドーム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ノギザカスキッツ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ノギザカスキッツ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハイレゾリューションオーディオ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ハイレゾリューションオーディオ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハウス食品'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ハウス食品'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハルジオンが咲く頃'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ハルジオンが咲く頃'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ハロー!プロジェクトのメンバーオーディション'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ハロー!プロジェクトのメンバーオーディション'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/バナナマン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'バナナマン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/バレッタ_(乃木坂46の曲)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'バレッタ (乃木坂46の曲)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ビッグコミックスピリッツ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ビッグコミックスピリッツ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ファンタ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ファンタ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/フジテレビジョン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'フジテレビジョン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/フランス語'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'フランス語'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/フレンチ・ポップス'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'フレンチ・ポップス'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ブブカ_(雑誌)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ブブカ (雑誌)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/マカオグランプリ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'マカオグランプリ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/マガジンハウス'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'マガジンハウス'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/マギ_(漫画)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'マギ (漫画)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ミュージックステーション'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ミュージックステーション'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ミュージックレイン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ミュージックレイン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ミュージック・ビデオ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ミュージック・ビデオ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ミリオンセラー'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ミリオンセラー'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ミーツポート'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ミーツポート'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/メガシャキ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'メガシャキ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/メルセデス・ベンツアリーナ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'メルセデス・ベンツアリーナ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/モンスターハンター'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'モンスターハンター'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ヤマハミュージックエンタテインメントホールディングス'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ヤマハミュージックエンタテインメントホールディングス'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ヤマハミュージックメディア'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ヤマハミュージックメディア'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ライブビューイング'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ライブビューイング'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ラブベリー'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ラブベリー'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/リセアン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'リセアン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/レコチョク'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'レコチョク'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ワンダーウーマン_(映画)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ワンダーウーマン (映画)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/ヴィレッジヴァンガード_(書籍・雑貨店)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'ヴィレッジヴァンガード (書籍・雑貨店)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/七つの大罪_(漫画)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '七つの大罪 (漫画)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/上海市'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '上海市'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/下尾みう'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '下尾みう'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/与田祐希'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '与田祐希'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/世界ツーリングカー選手権'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '世界ツーリングカー選手権'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/世界中の隣人よ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '世界中の隣人よ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/中元日芽香'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '中元日芽香'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/中村麗乃'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '中村麗乃'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/中田花奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '中田花奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/主婦と生活社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '主婦と生活社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_1ST_YEAR_BIRTHDAY_LIVE_2013.2.22_MAKUHARI_MESSE'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 1ST YEAR BIRTHDAY LIVE 2013.2.22 MAKUHARI MESSE'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_2ND_YEAR_BIRTHDAY_LIVE_2014.2.22_YOKOHAMA_ARENA'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 2ND YEAR BIRTHDAY LIVE 2014.2.22 YOKOHAMA ARENA'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_3rd_YEAR_BIRTHDAY_LIVE_2015.2.22_SEIBU_DOME'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 3rd YEAR BIRTHDAY LIVE 2015.2.22 SEIBU DOME'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_4th_YEAR_BIRTHDAY_LIVE_2016.8.28-30_JINGU_STADIUM'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 4th YEAR BIRTHDAY LIVE 2016.8.28-30 JINGU STADIUM'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_5th_YEAR_BIRTHDAY_LIVE_2017.2.20-22_SAITAMA_SUPER_ARENA'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 5th YEAR BIRTHDAY LIVE 2017.2.20-22 SAITAMA SUPER ARENA'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_6th_YEAR_BIRTHDAY_LIVE_2018.07.06-08_JINGU_STADIUM&CHICHIBUNOMIYA_RUGBY_STADIUM'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 6th YEAR BIRTHDAY LIVE 2018.07.06-08 JINGU STADIUM&CHICHIBUNOMIYA RUGBY STADIUM'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_7th_YEAR_BIRTHDAY_LIVE_2019.2.21-24_KYOCERA_DOME_OSAKA'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 7th YEAR BIRTHDAY LIVE 2019.2.21-24 KYOCERA DOME OSAKA'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_8th_YEAR_BIRTHDAY_LIVE_2020.2.21-24_NAGOYA_DOME'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 8th YEAR BIRTHDAY LIVE 2020.2.21-24 NAGOYA DOME'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46_真夏の全国ツアー2017_FINAL!_IN_TOKYO_DOME'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46 真夏の全国ツアー2017 FINAL! IN TOKYO DOME'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46の「の」'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46の「の」'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46のガクたび!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46のガクたび!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46のザ・ドリームバイト!〜働き方改革!夢への挑戦!〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46のザ・ドリームバイト!〜働き方改革!夢への挑戦!〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46の出演一覧'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46の出演一覧'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46リズムフェスティバル'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46リズムフェスティバル'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂46時間TV'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂46時間TV'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂って、どこ%3F'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂って、どこ?'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂どこへ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂どこへ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂工事中'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂工事中'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木坂浪漫'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木坂浪漫'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/乃木恋〜坂道の下で、あの日僕は恋をした〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '乃木恋〜坂道の下で、あの日僕は恋をした〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/久保史緒里'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '久保史緒里'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/井上小百合_(アイドル)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '井上小百合 (アイドル)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/今、話したい誰かがいる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '今、話したい誰かがいる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/今が思い出になるまで'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '今が思い出になるまで'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/今泉佑唯'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '今泉佑唯'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/令和元年台風第10号'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '令和元年台風第10号'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤かりん'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤かりん'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤万理華'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤万理華'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤寧々'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤寧々'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤理々杏'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤理々杏'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤由奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤由奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/伊藤純奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '伊藤純奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/会いたかった'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '会いたかった'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/佐々木琴子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '佐々木琴子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/佐々木美玲'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '佐々木美玲'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/何度目の青空か%3F'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '何度目の青空か?'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/僕だけの君〜Under_Super_Best〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '僕だけの君〜Under Super Best〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/僕は僕を好きになる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '僕は僕を好きになる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/光文社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '光文社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/入山杏奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '入山杏奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/全国高等学校クイズ選手権'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '全国高等学校クイズ選手権'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/六番町_(千代田区)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '六番町 (千代田区)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/初森ベマーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '初森ベマーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/制服のマネキン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '制服のマネキン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/前田敦子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '前田敦子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/劇団'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '劇団'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/加藤史帆'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '加藤史帆'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/加藤玲奈_(AKB48)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '加藤玲奈 (AKB48)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/北川悠理'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '北川悠理'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/北川謙二'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '北川謙二'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/北海道放送'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '北海道放送'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/北野日奈子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '北野日奈子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/南流石'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '南流石'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/厚生労働省'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '厚生労働省'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/双葉社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '双葉社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/台北アリーナ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '台北アリーナ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/合同会社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '合同会社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/吉本坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '吉本坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/向井地美音'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '向井地美音'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/向井葉月'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '向井葉月'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/君の名は希望'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '君の名は希望'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/君はメロディー'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '君はメロディー'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/告白実行委員会〜恋愛シリーズ〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '告白実行委員会〜恋愛シリーズ〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/命は美しい'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '命は美しい'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/和田まあや'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '和田まあや'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/国際宝飾展'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '国際宝飾展'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/土生瑞穂'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '土生瑞穂'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/坂口渚沙'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '坂口渚沙'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/坂道シリーズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '坂道シリーズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/堀未央奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '堀未央奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/夏のFree&Easy'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '夏のFree&Easy'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/夜明けまで強がらなくてもいい'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '夜明けまで強がらなくてもいい'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大人ジェリービーンズ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '大人ジェリービーンズ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大分市'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '大分市'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大和田南那'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '大和田南那'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大園桃子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '大園桃子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/大阪ドーム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '大阪ドーム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/太陽ノック'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '太陽ノック'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/安倍晋三'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '安倍晋三'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/宮沢セイラ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '宮沢セイラ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/宮脇咲良'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '宮脇咲良'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/寺田蘭世'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '寺田蘭世'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小坂菜緒'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小坂菜緒'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小嶋真子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小嶋真子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小嶋陽菜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小嶋陽菜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小林由依_(アイドル)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小林由依 (アイドル)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小栗有以'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小栗有以'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小池美波'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小池美波'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/小泉今日子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '小泉今日子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山下美月'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '山下美月'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山内瑞葵'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '山内瑞葵'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/山崎怜奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '山崎怜奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/岡田奈々_(AKB48)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '岡田奈々 (AKB48)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/岡部麟'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '岡部麟'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/島崎遥香'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '島崎遥香'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/川後陽菜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '川後陽菜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/市來玲奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '市來玲奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/希望的リフレイン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '希望的リフレイン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/帰り道は遠回りしたくなる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '帰り道は遠回りしたくなる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/幕張メッセ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '幕張メッセ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/平手友梨奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '平手友梨奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/幻冬舎'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '幻冬舎'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/弓木奈於'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '弓木奈於'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/影'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '影'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/影の内閣'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '影の内閣'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/徳間書店'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '徳間書店'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/心が叫びたがってるんだ。'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '心が叫びたがってるんだ。'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/悲しみの忘れ方_Documentary_of_乃木坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '悲しみの忘れ方 Documentary of 乃木坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/愛知県芸術劇場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '愛知県芸術劇場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/指原莉乃'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '指原莉乃'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/文化放送'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '文化放送'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/斉藤優里'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '斉藤優里'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/斎藤ちはる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '斎藤ちはる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/新内眞衣'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '新内眞衣'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/新宿御苑'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '新宿御苑'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/新浪微博'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '新浪微博'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日刊スポーツ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日刊スポーツ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日向坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日向坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本における2019年コロナウイルス感染症の流行状況'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本における2019年コロナウイルス感染症の流行状況'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本コカ・コーラ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本コカ・コーラ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本ゴールドディスク大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本ゴールドディスク大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本テレビ放送網'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本テレビ放送網'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本プロサッカーリーグ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本プロサッカーリーグ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本メガネベストドレッサー賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本メガネベストドレッサー賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本レコード協会'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本レコード協会'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本放送協会'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本放送協会'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本有線大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本有線大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本武道館'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本武道館'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本赤十字社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本赤十字社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/日本郵便'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本郵便'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/早川聖来'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '早川聖来'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/明治_(企業)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '明治 (企業)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/明治神宮野球場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '明治神宮野球場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/星野みなみ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '星野みなみ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/映像研には手を出すな!'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '映像研には手を出すな!'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/月刊AKB48グループ新聞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '月刊AKB48グループ新聞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/月刊カドカワ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '月刊カドカワ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/月刊ニュータイプ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '月刊ニュータイプ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/有明コロシアム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '有明コロシアム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/朝日新聞デジタル'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '朝日新聞デジタル'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/朝日新聞出版'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '朝日新聞出版'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/木材利用ポイント事業'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '木材利用ポイント事業'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/本田仁美'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '本田仁美'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京ガールズコレクション'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '東京ガールズコレクション'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京スポーツ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '東京スポーツ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京ドーム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '東京ドーム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京ニュース通信社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '東京ニュース通信社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/東京国際フォーラム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '東京国際フォーラム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/松井玲奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '松井玲奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/松井珠理奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '松井珠理奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/松村沙友理'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '松村沙友理'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/林修'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '林修'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/林芳正'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '林芳正'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/林野庁'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '林野庁'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/柏幸奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '柏幸奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/柏木由紀'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '柏木由紀'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/桜を見る会'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '桜を見る会'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/桜井玲香'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '桜井玲香'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/梅山恋和'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '梅山恋和'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/梅澤美波'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '梅澤美波'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/梅田芸術劇場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '梅田芸術劇場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/森ノ宮ピロティホール'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '森ノ宮ピロティホール'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/楽天'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '楽天'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/樋口日奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '樋口日奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/横山由依'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '横山由依'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/横浜アリーナ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '横浜アリーナ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/横浜国際総合競技場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '横浜国際総合競技場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/橋本奈々未'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '橋本奈々未'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/櫻坂46'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '櫻坂46'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/気づいたら片想い'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '気づいたら片想い'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/氣志團'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '氣志團'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/永島聖羅'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '永島聖羅'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/沢尻エリカ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '沢尻エリカ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/深川麻衣'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '深川麻衣'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/渡辺みり愛'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '渡辺みり愛'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/渡辺梨加'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '渡辺梨加'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/渡辺麻友'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '渡辺麻友'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/渡邉理佐'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '渡邉理佐'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/渡邉美穂_(アイドル)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '渡邉美穂 (アイドル)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/瀧野由美子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '瀧野由美子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/生のアイドルが好き'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '生のアイドルが好き'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/生まれてから初めて見た夢'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '生まれてから初めて見た夢'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/生田絵梨花'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '生田絵梨花'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/生駒里奈'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '生駒里奈'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/田中美久'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '田中美久'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/田村真佑'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '田村真佑'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/白石麻衣'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '白石麻衣'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/相楽伊織'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '相楽伊織'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/矢作萌夏'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '矢作萌夏'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/矢吹奈子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '矢吹奈子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/福岡聖菜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '福岡聖菜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/秋元康'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '秋元康'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/秋元真夏'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '秋元真夏'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/秩父宮ラグビー場'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '秩父宮ラグビー場'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第59回日本レコード大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第59回日本レコード大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第60回日本レコード大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第60回日本レコード大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第61回日本レコード大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第61回日本レコード大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第62回日本レコード大賞'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第62回日本レコード大賞'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第66回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第66回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第67回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第67回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第68回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第68回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第69回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第69回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第70回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第70回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/第71回NHK紅白歌合戦'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '第71回NHK紅白歌合戦'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/管理'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '管理'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/署名運動'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '署名運動'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/能條愛未'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '能條愛未'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/芸能事務所'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '芸能事務所'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/若月佑美'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '若月佑美'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/荒野行動'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '荒野行動'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/菅井友香'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '菅井友香'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/衛藤美彩'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '衛藤美彩'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/裸足でSummer'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '裸足でSummer'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/西武ドーム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '西武ドーム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/西野七瀬'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '西野七瀬'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/記念日'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '記念日'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/語彙・読解力検定'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '語彙・読解力検定'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/講談社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '講談社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/講談社文庫'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '講談社文庫'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/赤坂_(東京都港区)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '赤坂 (東京都港区)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/走れ!Bicycle'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '走れ!Bicycle'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/超能力研究部の3人'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '超能力研究部の3人'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/農林水産省'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '農林水産省'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/逃げ水'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '逃げ水'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/逃げ水_(曲)'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '逃げ水 (曲)'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/逃した魚たち〜シングル・ビデオコレクション〜'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '逃した魚たち〜シングル・ビデオコレクション〜'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/透明な色'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '透明な色'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/週刊プレイボーイ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '週刊プレイボーイ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/週刊ヤングジャンプ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '週刊ヤングジャンプ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/週刊ヤングマガジン'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '週刊ヤングマガジン'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/週刊大衆'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '週刊大衆'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/遠藤さくら'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '遠藤さくら'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/金川紗耶'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '金川紗耶'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/鈴木絢音'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '鈴木絢音'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/長濱ねる'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '長濱ねる'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/集英社'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '集英社'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/青春女子学園'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '青春女子学園'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/音楽ゲーム'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '音楽ゲーム'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/須田亜香里'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '須田亜香里'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/願いごとの持ち腐れ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '願いごとの持ち腐れ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/高山一実'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '高山一実'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/黒木メイサ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '黒木メイサ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/齊藤京子'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '齊藤京子'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:AKB48系のポップ・グループ'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': 'AKB48系のポップ・グループ'}}, {'wikiLink': {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/Category:日本レコード大賞受賞者'}, 'label': {'type': 'literal', 'xml:lang': 'ja', 'value': '日本レコード大賞受賞者'}}]}}\n"
     ]
    }
   ],
   "source": [
    "sparql.setQuery(\"\"\"\n",
    "PREFIX prop-ja: <http://ja.dbpedia.org/property/>\n",
    "PREFIX dbpedia-ja: <http://ja.dbpedia.org/resource/>\n",
    "PREFIX dbp-owl:<http://dbpedia.org/ontology/>\n",
    "\n",
    "select distinct * where {\n",
    "  # ?s rdf:type dbpedia-owl:Place.\n",
    "  dbpedia-ja:乃木坂46   dbp-owl:wikiPageWikiLink ?wikiLink.\n",
    "  ?wikiLink  rdfs:label  ?label .\n",
    "}\n",
    "\"\"\")\n",
    "results = sparql.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# wikidata は403 になる。"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# HTTPError: HTTP Error 403: Forbidden\n",
    "# Wikidata SPARQL 403 HTTP Errors\n",
    "# https://www.mediawiki.org/wiki/Topic:V1zau9rqd4ritpug\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas as pd\n",
    "sparql_wikidata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "# https://query.wikidata.org/#\")\n",
    "# From https://www.wikidata.org/wiki/Wikidata:SPARQL_query_service/queries/examples#Cats\n",
    "sparql_wikidata.setQuery(\"\"\"\n",
    "SELECT ?item ?itemLabel\n",
    "WHERE\n",
    "{\n",
    "    ?item wdt:P31 wd:Q146 .\n",
    "    SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" }\n",
    "}\n",
    "\"\"\")\n",
    "sparql_wikidata.setReturnFormat(JSON)\n",
    "results = sparql_wikidata.query().convert()\n",
    "# print(results)\n",
    "# results_df = pd.io.json.json_normalize(results['results']['bindings'])\n",
    "# results_df[['item.value', 'itemLabel.value']].head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "sparql_wikidata = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "# SPARQLWrapper(endpoint='https://query.wikidata.org/#format=json', returnFormat='json')\n",
    "sparql_wikidata.setQuery(\"\"\"\n",
    "PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "# wikidata query service アニメのキャラクタの一覧がとにかく表示される\n",
    "SELECT DISTINCT ?character ?characterLabel ?workLabel WITH {\n",
    "  # Fictional character subclasses as a named subquery\n",
    "  SELECT ?fictiontype WHERE {\n",
    "    ?fictiontype wdt:P279* wd:Q80447738. hint:Prior hint:gearing \"forward\".\n",
    "  }\n",
    "} AS %i\n",
    "WHERE\n",
    "{\n",
    "  INCLUDE %i\n",
    "  ?character wdt:P31 ?fictiontype.\n",
    "  # Date of birth\n",
    "  { ?character wdt:P1441 ?work . }\n",
    "  SERVICE wikibase:label {\n",
    "    bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],ja\" . \n",
    "  }\n",
    "} \n",
    "ORDER BY ?work\n",
    "Limit 30\n",
    "\"\"\")\n",
    "results = sparql_wikidata.query().convert()\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "42751e3e43ee7908f4a4d17b9730cb6a060445f7f30ebfd63ff7271362d94c86"
  },
  "kernelspec": {
   "display_name": "Python 3.9.7 ('base')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
